import React, { useEffect, useState } from 'react'
import CardDirk from '../child/DKR'

const RandomDikr = () => {
  const [cards, setCards] = useState<any>([])
  const data: string[] = [
    'استغفر الله',
    'الحمد لله',
    'الله اكبر',
    'لا اله الا الله',
    'اشهد ان محمدا رسول الله',
    'اشهد ان لا اله الا الله',
    'الله اكبر',
    'الحمد لله',
    'بسم الله الرحمن الرحيم',
    'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ',
    'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
    ' اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ',
    'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.',
    ' سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ',
    ' أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ ',
    'رضيتُ باللهِ ربًّا وبالإسلامِ دينًا وبمحمَّدٍ صلَّى اللهُ عليه وسلَّم نبيًّا',
    'تب الى الله',
    'لا تقنط من رحمة الله',
    'الله غفور رحيم',
    'الله شديد العقاب',
    'قل أذلك خير أم جنة الخلد التي وعد المتقون',
    'افعل ما شأت ولا تنسى القبر',
    'بارك الله فيك وفي جهودك، واجعلنا من الذين يسعى لرضا الله في كل الأحوال.',
    'حينما تشعر بالضيق والهم، تذكر أن الله معك وأنه لا يضيع جهدك وصبرك.',
    'احرص على الصلاة في وقتها المحدد، فهي وصلة بينك وبين الله، وطريقك للسكينة والراحة.',
    'التوكل على الله يجعل الحياة أكثر سهولة، فثق بقضاء الله ولا تحزن.',
    'احمد الله في السراء والضراء، فالشكر لله يزيد من نعمه.',
    'تذكير دائم بأن الدنيا متاجر قصيرة، فاستثمر وقتك في طاعة الله وفعل الخيرات.',
    'كن صادقًا في أقوالك وأفعالك، فالصدق طريق للقرب من الله.',
    'لا تجعل الهموم والضغوط الحياتية تبتعدك عن الله، بل ابحث عن قوتك في الصلاة والتسبيح.',
    'العمل الصالح يرفع درجاتك في الدنيا والآخرة، فاجعل كل عمل تقوم به خالصًا لوجه الله.',
    'تذكر دائماً أن الله يعلم ما في قلوبنا، فابتغِ رضاه في كل لحظة.',
    'تجنب الغيبة والنميمة، فإن الله يحاسب على كل كلمة يوم القيامة.',
    'اجتنب الرياء وابذل جهدك في تحقيق الاخلاص في كل أعمالك.',
    'العفو والتسامح طريق للسلام الداخلي، فلا تحمل الحقد والكراهية في قلبك.',
    'صدق النية في العطاء والعمل الخيري، فالله يحب المحسنين.',
    'اعتن بعلاقتك بالقرآن الكريم، ففيه هدى وشفاء للقلوب.',
    'الصدق والأمانة سمتان عظيمتان، فكن صادقاً في كلمتك ووفياً في التزاماتك.',
    'استعن بالدعاء في كل أمورك، فإن الله هو المجيب للدعاء.',
    'كن على يقين أن الله يحب التوبة، فإذا أخطأت فراجع نفسك وارجع إلى الله.',
    'التسليم لقضاء الله والرضا بما قدر لك يجلب السكينة والطمأنينة.',
    'الإحسان إلى الآخرين هو عبادة، فكن محسنًا وسامح من ظلمك.',
    'قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)',
    ' قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5) ',
    ' إِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ (1) فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ (2) إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ (3) ',
    'تب الى الله ، وان رجعت الى الذنب ، اعد التوبة الى الله ، واعد التوبة ، الله لا يمل',
    'سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك اللهم وأتوب إليك',
    ' اللهم إني أستغفرك لكل ذنب يعقب الحسرة، ويورث الندامة ويحبس الرزق ',
    'للهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك',
    'اللهم لا تجعل ابتلائي في جسدي، ولا في مالي، ولا في أهلي، وسهّل علي ما استثقلته نفسي',
    'اللهم بك استعين وعليك اتوكل، اللهم ذلل لي صعوبة أمري وسهل لي مشقته وأرزقني من الخير كله أكثر مما أطلب وأصرف عني كل شرـ رب اشرح لي صدري، ويسر لي أمري يا كريم اللهم يسر لي الخير حيث كنت وحيث توجهت',
    'للهم هون علينا سفرنا هذا وطوي عنا بعده،',
    'اللهم إني أستغفرك من كل ذنب أتيته عامدا متعمدا، لطغوى نفسي علي وإسرافي في اتباعها',
    'للهم إني أسألك الجنة وما قرب إليها من قول وعمل، وأعوذ بك من النار وما قرب إليها من قول وعمل، وأعوذ بك أن أقول زورًا أو أغشى فجورًا أو أكون بك مغرورًا',
  ] // قم بتعيين قيم لمصفوفة البيانات dikr

  useEffect(() => {
    const interval = setInterval(() => {
      setCards((prevCards) => [
        ...prevCards.slice(1),
        {
          index: prevCards.length,
          dikr: data[Math.floor(Math.random() * data.length)],
        },
      ])
    }, 4000)

    return () => clearInterval(interval)
  }, [])

  return (
    <div>
      <div className="flex flex-wrap justify-center items-center">
        {cards.map((card) => (
          <CardDirk key={card.index} index={card.index} dikr={card.dikr} />
        ))}
      </div>
    </div>
  )
}

export default RandomDikr
